Revit 2024 API
ScheduleField Class
 A field in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ScheduleField : IDisposable
Visual Basic
Public Class ScheduleField _
	Implements IDisposable
Visual C++
public ref class ScheduleField : IDisposable
Remarks
The ScheduleField class represents a single field in a ScheduleDefinition's list of fields. Each (non-hidden) field becomes a column in the schedule.
Most commonly, a field represents an instance or type parameter of elements appearing in the schedule. Some fields represent parameters of other related elements, like the room that a scheduled element belongs to. Fields can also represent data calculated from other fields in the schedule, specifically Formula and Percentage fields. Another type of field is Custom Field. For this one, the value for each row is computed based on the (sub)elements that are grouped on that row and can have a graphic representation when the schedule is placed on a sheet.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ScheduleField
See Also
ScheduleField Members
Autodesk.Revit.DB Namespace